test/vcr_cassettes/capture_payment.json

[
  {
    "request": {
      "body": "{\"token\":\"TestToken\",\"serviceId\":\"TestService\",\"exchangeUrl\":\"https://smee.io/paynl_ipn\",\"description\":\"Test capture\",\"currency\":\"EUR\",\"bankAccountNumber\":\"NL24ABNA0123456789\",\"bankAccountHolder\":\"Test Muppet\",\"amount\":100}",
      "headers": {
        "Content-Type": "application/json",
        "authentication": "BASIC VGVzdFRva2VuOlRlc3RUb2tlbg=="
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://rest-api.pay.nl/v3/DirectDebit/debitAdd/json"
    },
    "response": {
      "body": "{\"request\":{\"result\":\"1\",\"errorId\":\"\",\"errorMessage\":\"\"},\"result\":\"IO-9590-1286-3280\"}",
      "headers": {
        "Date": "Mon, 11 Feb 2019 13:51:09 GMT",
        "Server": "Apache",
        "Set-Cookie": "device_id=8cad27b0595b4b6df2a818da4bd294992845ddd9; expires=Tue, 11-Feb-2020 13:51:09 GMT; path=/; domain=.pay.nl; httponly",
        "Expires": "Mon, 26 Jul 1990 05:00:00 GMT",
        "Last-Modified": "Mon, 11 Feb 2019 13:51:09 GMT",
        "Cache-Control": "post-check=0, pre-check=0",
        "Pragma": "no-cache",
        "X-Frame-Options": "SAMEORIGIN",
        "X-XSS-Protection": "1; mode=block",
        "X-Content-Type-Options": "nosniff",
        "Content-Length": "86",
        "Connection": "close",
        "Content-Type": "application/json"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]
