test/vcr_cassettes/payment_url_with_valid_credentials.json

[
  {
    "request": {
      "body": "{\"transaction[sendReminderEmail]\":\"0\",\"transaction[orderExchangeUrl]\":\"https://example.com/notify\",\"transaction[currency]\":\"EUR\",\"token\":\"TestToken\",\"testMode\":\"1\",\"serviceId\":\"TestService\",\"ipAddress\":\"127.0.0.1\",\"finishUrl\":\"https://example.com/return\",\"enduser[language]\":\"EN\",\"amount\":100}",
      "headers": {
        "Content-Type": "application/json",
        "authentication": "BASIC VGVzdFRva2VuOlRlc3RUb2tlbg=="
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://rest-api.pay.nl/v13/Transaction/start/json"
    },
    "response": {
      "body": "{\"request\":{\"result\":\"1\",\"errorId\":\"\",\"errorMessage\":\"\"},\"endUser\":{\"blacklist\":\"0\"},\"transaction\":{\"transactionId\":\"1043647342X62be2\",\"paymentURL\":\"https:\\/\\/api.pay.nl\\/controllers\\/payments\\/issuer.php?orderId=1043647342X62be2&entranceCode=4dccfb1da8876630de9f39af5e9ee4613f7acb8b&profileID=613&lang=NL\",\"popupAllowed\":\"0\",\"paymentReference\":\"2000 0010 4364 7342\"}}",
      "headers": {
        "Date": "Mon, 11 Feb 2019 13:44:22 GMT",
        "Server": "Apache",
        "Set-Cookie": "device_id=07bec6c72664b05105d66b147deda25238e4c0ca; expires=Tue, 11-Feb-2020 13:44:22 GMT; path=/; domain=.pay.nl; httponly",
        "Expires": "Mon, 26 Jul 1990 05:00:00 GMT",
        "Last-Modified": "Mon, 11 Feb 2019 13:44:22 GMT",
        "Cache-Control": "post-check=0, pre-check=0",
        "Pragma": "no-cache",
        "X-Frame-Options": "SAMEORIGIN",
        "X-XSS-Protection": "1; mode=block",
        "X-Content-Type-Options": "nosniff",
        "Content-Length": "368",
        "Connection": "close",
        "Content-Type": "application/json"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]
