test/vcr_cassettes/payment_url_with_valid_credentials_and_provider.json

[
  {
    "request": {
      "body": "{\"transaction[sendReminderEmail]\":\"0\",\"transaction[orderExchangeUrl]\":\"https://example.com/notify\",\"transaction[currency]\":\"EUR\",\"token\":\"TestToken\",\"testMode\":\"1\",\"serviceId\":\"TestService\",\"paymentOptionId\":10,\"ipAddress\":\"127.0.0.1\",\"finishUrl\":\"https://example.com/return\",\"enduser[language]\":\"EN\",\"amount\":100}",
      "headers": {
        "Content-Type": "application/json",
        "Authorization": "Basic VGVzdFRva2VuOlRlc3RUb2tlbg=="
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://rest-api.pay.nl/v13/Transaction/start/json"
    },
    "response": {
      "body": "{\"request\":{\"result\":\"1\",\"errorId\":\"\",\"errorMessage\":\"\"},\"endUser\":{\"blacklist\":\"0\"},\"transaction\":{\"transactionId\":\"1043651608X9d0fe\",\"paymentURL\":\"https:\\/\\/api.pay.nl\\/controllers\\/payments\\/issuer.php?orderId=1043651608X9d0fe&entranceCode=9cacf107a77c0b890974daa2e3ef04426a227fdf&profileID=613&lang=NL\",\"popupAllowed\":\"0\",\"paymentReference\":\"2000 0010 4365 1608\"}}",
      "headers": {
        "Date": "Mon, 11 Feb 2019 13:55:59 GMT",
        "Server": "Apache",
        "Set-Cookie": "device_id=a0932cd63cce173aeaf8603a1127d7b0bb06c865; expires=Tue, 11-Feb-2020 13:55:59 GMT; path=/; domain=.pay.nl; httponly",
        "Expires": "Mon, 26 Jul 1990 05:00:00 GMT",
        "Last-Modified": "Mon, 11 Feb 2019 13:55:59 GMT",
        "Cache-Control": "post-check=0, pre-check=0",
        "Pragma": "no-cache",
        "X-Frame-Options": "SAMEORIGIN",
        "X-XSS-Protection": "1; mode=block",
        "X-Content-Type-Options": "nosniff",
        "Content-Length": "368",
        "Connection": "close",
        "Content-Type": "application/json"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]
